charliermarsh.ruff
cschlosser.doxdocgen
dotjoshjohnson.xml
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
igorsbitnev.error-gutters
kevinkyang.auto-comment-blocks
llvm-vs-code-extensions.vscode-clangd
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
njpwerner.autodocstring
oderwat.indent-rainbow
openai.chatgpt
pkief.material-icon-theme
redhat.vscode-xml
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
tamasfe.even-better-toml
tuttieee.emacs-mcx
twxs.cmake
usernamehw.errorlens
yzhang.markdown-all-in-one
